<?php
function AllNews($news){
    foreach ($news as $new){
        echo $new . '<br>';
    }
}

function News ($news){
    $id = (int)$_GET['id'];
    echo $news[$id];
}

$news='Четыре новосибирские компании вошли в сотню лучших работодателей
Выставка университетов США: открой новые горизонты
Оценку «неудовлетворительно» по качеству получает каждая 5-я квартира в новостройке
Студент-изобретатель раскрыл запутанное преступление
Хоккей: «Сибирь» выстояла против «Ак Барса» в пятом матче плей-офф
Здоровое питание: вегетарианская кулинария
День святого Патрика: угощения, пивной теннис и уличные гуляния с огнем
«Красный факел» пустит публику на ночные экскурсии за кулисы и по закоулкам столетнего здания
Звезды телешоу «Голос» Наргиз Закирова и Гела Гуралиа споют в «Маяковском»';
$news =  explode("\n", $news);

if (isset($_GET['id'])){
    if($_GET['id']<=8){
        News($news);
    } else {
        AllNews($news);
    }
}
elseif(empty($_GET)){
     AllNews($news);
} else {
    header("HTTP/1.0 404 Not Found");
    echo '<h1>Ошибка 404</h1>';
    echo '<p>Такой страницы не существует</p>';
    echo '<a href="hw5.1.php">Вернуться</a> на главную страницу?';
} 

